Dlubal.RFEM5.AnalysisParameters
Analysis parameters

Dlubal.RFEM5.AnalysisParameters.Loading
Loading (read only)

Dlubal.RFEM5.AnalysisParameters.Method
Method of analysis

Dlubal.RFEM5.AnalysisParameters.SolvingSystemMethod
Method for solving system of nonlinear algebraic equations

Dlubal.RFEM5.AnalysisParameters.ModifyLoadingByFactor
Modify loading by factor

Dlubal.RFEM5.AnalysisParameters.LoadingFactor
Loading factor

Dlubal.RFEM5.AnalysisParameters.DivideResultsByFactor
Divide results by loading factor

Dlubal.RFEM5.AnalysisParameters.StiffnessFactorsMaterials
Activate stiffness factors of materials (partial factor γM)

Dlubal.RFEM5.AnalysisParameters.StiffnessFactorsCrossSections
Activate stiffness factors of cross-sections (factor for J, Iy, Iz, A, Ay, Az)

Dlubal.RFEM5.AnalysisParameters.StiffnessFactorsMembers
Activate stiffness factors of members (factor for GJ, EIy, EIz, EA, GAy, GAz)

Dlubal.RFEM5.AnalysisParameters.ConsiderFavorableEffects
Consider favorable effects due to tension of members

Dlubal.RFEM5.AnalysisParameters.ReferIF
Refer internal forces to deformed structure

Dlubal.RFEM5.AnalysisParameters.ReferIFForNormalForces
Refer internal forces to deformed structure for normal forces N

Dlubal.RFEM5.AnalysisParameters.ReferIFForShearForces
Refer internal forces to deformed structure for shear forces Vy and Vz

Dlubal.RFEM5.AnalysisParameters.ReferIFForMoments
Refer internal forces to deformed structure for moments My, Mz, MT

Dlubal.RFEM5.AnalysisParameters.CalculateKinematicMechanism
Try to calculate kinematic mechanism (add low geometric stiffness in first iteration)

Dlubal.RFEM5.AnalysisParameters.LoadIncrements
Apply separate number of load increments for this load case/combination

Dlubal.RFEM5.AnalysisParameters.SaveResults
Save results of all load increments

Dlubal.RFEM5.AnalysisParameters.SaveResultsIteration
Save results for each n-th iteration.